def 初始化():
    return [
        {
        "word": "杦",
        "oldword": "杦",
        "strokes": "3",
        "pinyin": "jiǔ",
        "radicals": "",
        "explanation": "杦jiǔ 1.日本和字。",
        "more": "搜索与“杦”有关的包含有“杦”字的成语 查找以“杦”打头的成语接龙"
    },
    {
        "word": "九",
        "oldword": "九",
        "strokes": "2",
        "pinyin": "jiǔ",
        "radicals": "丿",
        "explanation": "九 \n\n (指事。本义数词。比八大一的基数)\n\n 同本义 \n\n 古人造字以纪数,起于一,极于九,皆指事也。二三四为积画,余皆变化其体。--朱骏声《说文通训定声》\n\n 乾玄用九,乃见天则。--《易·文言》传\n\n 九者,阳之数,道之纲纪也。--《楚辞·九辨》序\n\n 天道以九制。--《管子·五行》\n\n 又如九伯(宋时把痴傻人叫九伯。也写作九百”);小九九(珠算的乘法口诀;方言中比喻算计);九九(算法名。称一至九每二数相乘之数为九九;九的自乘数);九地(九种土地)\n\n 第九 \n\n 可数序列中第八加一的序数。如九连\n\n 《周易》以阳爻为九\n\n 初九,潜龙勿用\n\n 九jiǔ\n\n ⒈数目字～鼎。泛指多数、多次或多层～牛二虎之力。～死一生。～霄云外。\n\n ⒉时令。\n\n 九jiū 1.聚。",
    },
    {
        "word": "久",
        "oldword": "久",
        "strokes": "3",
        "pinyin": "jiǔ",
        "radicals": "丿",
        "explanation": "久 \n\n 灸灼。灸”的古字 \n\n 其腹有久故瘢二所。--《睡虎地秦墓竹简》\n\n 久,以后灸之,象人两胫后有距也。--《说文》\n\n 皆木桁,久之。--《仪礼·既夕礼》。注当为灸。”\n\n 支撑 \n\n 久诸墙以观其桡也。--《周礼·庐人》。注犹柱也。今本以灸为之。”\n\n 堵塞 \n\n 幂用疏布久之。--《仪礼·士丧礼》\n\n 等待 \n\n 轩骄之兵,则恭敬而久之。--《银雀山汉墓竹简》\n\n 滞留 \n\n 为久也。--《公羊传·庄公八年》\n\n 寡君以为盟主之故,是以久子。--《左传》。杨伯峻注久子,久留子于晋也。”\n\n 久jiǔ\n\n ⒈时间长天长日～。～经考验。～别重逢。\n\n ⒉经过的时间好～？多～了？\n\n ⒊早就～仰。～慕大名。\n\n 久jiù 1.贫穷。",
        
    }
    ]

原始数据 = None

# API
def 查(字):
    global 原始数据
    if 原始数据 == None:
        原始数据 = 初始化()
    符合条件 = []
    for 字数据 in 原始数据:
        if 字 == 字数据['word']:
            return 字数据
